# Missing data

In [167]:
import numpy as np
import pandas as pd

In [168]:
data = {
    'name' : [np.nan,'kaushik,','jay',np.nan,'mayur','pankaj',np.nan,'kajal'],
    'age' : [22,12,14,np.inf,np.nan,45,np.nan,25],
    'salary' : [20000,23000,120000,30000,np.inf,0,np.inf,80000],
    'dept' : ['IT',np.nan,'Account','Clerk','IT','Seles',np.nan,'IT']
}

df = pd.DataFrame(data)
df

       name   age    salary     dept
0       NaN  22.0   20000.0       IT
1  kaushik,  12.0   23000.0      NaN
2       jay  14.0  120000.0  Account
3       NaN   inf   30000.0    Clerk
4     mayur   NaN       inf       IT
5    pankaj  45.0       0.0    Seles
6       NaN   NaN       inf      NaN
7     kajal  25.0   80000.0       IT

In [169]:
# define null value
df.isna()

    name    age  salary   dept
0   True  False   False  False
1  False  False   False   True
2  False  False   False  False
3   True  False   False  False
4  False   True   False  False
5  False  False   False  False
6   True   True   False   True
7  False  False   False  False

In [170]:
df.isna().any()

name       True
age        True
salary    False
dept       True
dtype: bool

In [171]:
# remove null value
df.dropna()

     name   age    salary     dept
2     jay  14.0  120000.0  Account
5  pankaj  45.0       0.0    Seles
7   kajal  25.0   80000.0       IT

In [172]:
# np.dropna(thresh = 3) ---> minimum 3 value not null honi chahiye
df.dropna(thresh=3)

       name   age    salary     dept
0       NaN  22.0   20000.0       IT
1  kaushik,  12.0   23000.0      NaN
2       jay  14.0  120000.0  Account
3       NaN   inf   30000.0    Clerk
4     mayur   NaN       inf       IT
5    pankaj  45.0       0.0    Seles
7     kajal  25.0   80000.0       IT

# filling the data

In [173]:
df.fillna(0)

       name   age    salary     dept
0         0  22.0   20000.0       IT
1  kaushik,  12.0   23000.0        0
2       jay  14.0  120000.0  Account
3         0   inf   30000.0    Clerk
4     mayur   0.0       inf       IT
5    pankaj  45.0       0.0    Seles
6         0   0.0       inf        0
7     kajal  25.0   80000.0       IT

In [174]:
df

       name   age    salary     dept
0       NaN  22.0   20000.0       IT
1  kaushik,  12.0   23000.0      NaN
2       jay  14.0  120000.0  Account
3       NaN   inf   30000.0    Clerk
4     mayur   NaN       inf       IT
5    pankaj  45.0       0.0    Seles
6       NaN   NaN       inf      NaN
7     kajal  25.0   80000.0       IT

In [175]:
values = {'name' : 'john', 'age' : 18,'salary' : 10000,'dept': 'clerk'}

df.fillna(value=values)

       name   age    salary     dept
0      john  22.0   20000.0       IT
1  kaushik,  12.0   23000.0    clerk
2       jay  14.0  120000.0  Account
3      john   inf   30000.0    Clerk
4     mayur  18.0       inf       IT
5    pankaj  45.0       0.0    Seles
6      john  18.0       inf    clerk
7     kajal  25.0   80000.0       IT

In [176]:
df

       name   age    salary     dept
0       NaN  22.0   20000.0       IT
1  kaushik,  12.0   23000.0      NaN
2       jay  14.0  120000.0  Account
3       NaN   inf   30000.0    Clerk
4     mayur   NaN       inf       IT
5    pankaj  45.0       0.0    Seles
6       NaN   NaN       inf      NaN
7     kajal  25.0   80000.0       IT

In [ ]:
df['name'] = df['name'].fillna('john')

In [179]:
df

       name   age    salary     dept
0      john  22.0   20000.0       IT
1  kaushik,  12.0   23000.0      NaN
2       jay  14.0  120000.0  Account
3      john   inf   30000.0    Clerk
4     mayur   NaN       inf       IT
5    pankaj  45.0       0.0    Seles
6      john   NaN       inf      NaN
7     kajal  25.0   80000.0       IT

In [182]:
df.replace([np.inf, -np.inf],0, inplace=True)

In [184]:
df.fillna(0,inplace=True)

In [185]:
df

       name   age    salary     dept
0      john  22.0   20000.0       IT
1  kaushik,  12.0   23000.0        0
2       jay  14.0  120000.0  Account
3      john   0.0   30000.0    Clerk
4     mayur   0.0       0.0       IT
5    pankaj  45.0       0.0    Seles
6      john   0.0       0.0        0
7     kajal  25.0   80000.0       IT